# GetLevelOffset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LevelAssociationData..::..GetLevelOffset Method
LevelAssociationData Class See Also
---
Returns the offset from the Associated Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double GetLevelOffset()
```

Visual Basic
---
```text
Public Function GetLevelOffset As Double
```

Visual C++
---
```text
public:
double GetLevelOffset()
```

# See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace